Revit 2027 API
AddInId Constructor
 creates an AddInId object with a given GUID
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AddInId(
	Guid val
)
Public Sub New (
	val As Guid
)
public:
AddInId(
	Guid val
)
new :
        val : Guid -> AddInId
Parameters
val Guid
 GUID value
See Also
Reference
AddInId Class
Autodesk.Revit.DB Namespace